def tg_emoji(emoji_id: str, fallback: str) -> str:
    return f'<tg-emoji emoji-id="{emoji_id}">{fallback}</tg-emoji>'


EMOJI = {
    "message": "5255785423241754965",
    "heart": "5253591687090941617",
    "fire": "5208958898052023563",
    "one": "5188325338291122405",
    "two": "5190877111505661578",
    "three": "5190668586548473202",
    "four": "5190528261376978203",
    "lamp": "5256208696563742062",
    "gift": "5256044723302314069",
    "calendar": "5255885934066413926",
    "thumb": "5256258007083281685",
    "gear": "5255861070500737599",
    "lock": "5256212781077640210",
    "puzzle": "5256236931678744694",
    "key": "5255800709030358005",
    "pin": "5253704713450304416",
    "hash": "5255952514649437680",
}


EMOJI_FALLBACK = {
    "message": "✉️",
    "heart": "❤️",
    "fire": "🔥",
    "one": "1️⃣",
    "two": "2️⃣",
    "three": "3️⃣",
    "four": "4️⃣",
    "lamp": "ℹ️",
    "gift": "🎁",
    "calendar": "📅",
    "thumb": "👍",
    "gear": "⚙️",
    "lock": "🔒",
    "puzzle": "🧩",
    "key": "🔑",
    "pin": "📌",
    "hash": "#️⃣",
}
